Project/Toir/src/InformationRegisters/ВерсииОбъектов/ВерсииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииОбъектов</name>
  <resources>
    <name>ВерсияОбъекта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>АвторВерсии</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВерсии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВерсииОбъекта</name>
    <type>
      <types>EnumRef.ТипыВерсийОбъекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПроигнорирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДанныеВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияВладелец</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <comment>Технический реквизит, используется при выгрузке данных в РИБ</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Синхронизируется</name>
    <comment>Технический реквизит, используется при выгрузке данных в РИБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смещение</name>
    <comment>Технический реквизит, используется при выгрузке данных в РИБ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/ВерсииОбъектов/Forms/ФормаСписка/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьЗаписи(Команда)
	
	ТекстВопроса = НСтр("es='La desaparición de las anotaciones según las versiones de los objetos puede llevar a la imposibilidad "
"de la ejecución del análisis de toda la cadenita de los cambios de estos objetos. ¿Continuar?';ru='Удаление записей по версиям объектов может привести к невозможности "
"выполнения анализа всей цепочки изменений этих объектов. Продолжить?';en='Deleting records by version of objects may result in impossibility"
"analysis of the entire chain of changes of these objects. Continue?'");
		
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьЗаписиЗавершение", ЭтотОбъект, Элементы.Список.ВыделенныеСтроки);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("es='La prevención';ru='Предупреждение';en='Warning'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьЗаписиЗавершение(РезультатВопроса, СписокЗаписей) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьВерсииИзРегистра(СписокЗаписей);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьВерсииИзРегистра(Знач СписокЗаписей)
	
	Для Каждого КлючЗаписи Из СписокЗаписей Цикл
		НаборЗаписей = РегистрыСведений.ВерсииОбъектов.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Объект.Значение = КлючЗаписи.Объект;
		НаборЗаписей.Отбор.Объект.ВидСравнения = ВидСравнения.Равно;
		НаборЗаписей.Отбор.Объект.Использование = Истина;
		
		НаборЗаписей.Отбор.НомерВерсии.Значение = КлючЗаписи.НомерВерсии;
		НаборЗаписей.Отбор.НомерВерсии.ВидСравнения = ВидСравнения.Равно;
		НаборЗаписей.Отбор.НомерВерсии.Использование = Истина;
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
